class 组件名称管理类(object):
    组件索引值 = {}

    def __init__(self):
        pass

    def 取新名称(self, 组件名称, 键名称数组=None):
        if 键名称数组 is None:
            键名称数组 = []
        if self.组件索引值.get(组件名称) is None:
            self.组件索引值[组件名称] = 0
        self.组件索引值[组件名称] = int(self.组件索引值[组件名称]) + 1
        新的组件名称 = 组件名称 + str(self.组件索引值[组件名称])
        #  查询 键名称数组 是否有 组件名称 有则重新生成组件名称
        while self.检查重复(新的组件名称, 键名称数组):
            新的组件名称 = self.取新名称(组件名称, 键名称数组) + "_冲突"
            # 替换文本中多余的重复
            新的组件名称 = 新的组件名称.replace("_冲突_冲突", "_冲突")
        return 新的组件名称

    def 检查重复(self, 新的组件名称, 键名称数组=None):
        if 键名称数组 is None:
            键名称数组 = []
        for 键名称 in 键名称数组:
            if 新的组件名称 in 键名称:
                return True
        return False


if __name__ == "__main__":
    组件名称管理类 = 组件名称管理类()
    键列表 = ["按钮1", "按钮2", "按钮3", "按钮4", "按钮5", "按钮6", "按钮7", "按钮8", "按钮9", "按钮10"]
    id = 组件名称管理类.取新名称("按钮", 键列表)
    print(id)
    id = 组件名称管理类.取新名称("按钮", 键列表)
    print(id)
    id = 组件名称管理类.取新名称("按钮", 键列表)
    print(id)
    id = 组件名称管理类.取新名称("按钮", 键列表)
    print(id)
    id = 组件名称管理类.取新名称("按钮", 键列表)
    print(id)
